TestCases/Archive/OpenEvap/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
800
(
0.99
0.99
0.99
0.99
0.99
0.99
0.99
0.99
...
)
;

boundaryField
{
    Walls
    {
        type            zeroGradient;
    }
    Top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    FrontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
