TestCases/Archive/OpenEvap/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0     0     0)
    (0.02   0     0)
    (0.02   0.02  0)
    (0     0.02  0)
    (0     0     1E-3)
    (0.02   0     1E-3)
    (0.02   0.02  1E-3)
    (0     0.02  1E-3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 40 1) simpleGrading (1 8 1)
);


boundary
(
    Walls
    {
        type    wall;
        faces
        (
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    Top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }
    FrontAndBack
    {
        type    empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);


// ************************************************************************* //
